<h1><center>Experiment 5</center></h1>
<h2><center> Experiment on various joins in MYSQL<h2><center>

In [1]:
import mysql.connector

In [2]:
import pandas as pd

In [11]:
dataBase = mysql.connector.connect( 
  host ="localhost", 
  user ="root", 
  passwd ="password",
  database = "College"
)

In [12]:
# preparing a cur object 
cur = dataBase.cursor()

In [13]:
query = """
    CREATE TABLE IF NOT EXISTS emp(
        e_id INT(10) PRIMARY KEY, 
        e_name TEXT NOT NULL,
        e_city TEXT(10)
    )
"""
cur.execute(query)

In [14]:
query = """
    CREATE TABLE IF NOT EXISTS dept(
        dept_no VARCHAR(10) PRIMARY KEY, 
        dept_name TEXT NOT NULL,
        Location TEXT NOT NULL,
        e_id INT(10) REFERENCES emp(e_id) 
    )
"""
cur.execute(query)

In [15]:
query = """insert into emp values
        (1,'Ram','Delhi'),
        (2,'Varun','Mumbai'),
        (3,'Ravi','Mumbai'),
        (4,'Amrit','Delhi')
"""
cur.execute(query)
dataBase.commit()

In [16]:
query = """insert into dept values
        ('D1','HR','Delhi',1),
        ('D2','IT','Hyderabad',2),
        ('D3','Marketing','Mumbai',4)
"""
cur.execute(query)
dataBase.commit()

In [17]:
pd.read_sql("select * from emp;",dataBase)

   e_id e_name  e_city
0     1    Ram   Delhi
1     2  Varun  Mumbai
2     3   Ravi  Mumbai
3     4  Amrit   Delhi

In [18]:
pd.read_sql("select * from dept;",dataBase)

  dept_no  dept_name   Location  e_id
0      D1         HR      Delhi     1
1      D2         IT  Hyderabad     2
2      D3  Marketing     Mumbai     4

###### CROSS JOIN

In [19]:
pd.read_sql("select * from emp cross join dept;",dataBase)

    e_id e_name  e_city dept_no  dept_name   Location  e_id
0      1    Ram   Delhi      D1         HR      Delhi     1
1      1    Ram   Delhi      D2         IT  Hyderabad     2
2      1    Ram   Delhi      D3  Marketing     Mumbai     4
3      2  Varun  Mumbai      D1         HR      Delhi     1
4      2  Varun  Mumbai      D2         IT  Hyderabad     2
5      2  Varun  Mumbai      D3  Marketing     Mumbai     4
6      3   Ravi  Mumbai      D1         HR      Delhi     1
7      3   Ravi  Mumbai      D2         IT  Hyderabad     2
8      3   Ravi  Mumbai      D3  Marketing     Mumbai     4
9      4  Amrit   Delhi      D1         HR      Delhi     1
10     4  Amrit   Delhi      D2         IT  Hyderabad     2
11     4  Amrit   Delhi      D3  Marketing     Mumbai     4

###### NATURAL JOIN

In [52]:
pd.read_sql("select e_name from emp natural join dept;",dataBase)

  e_name
0    Ram
1  Varun
2  Amrit

###### EQUI JOIN

In [24]:
pd.read_sql("select * from emp,dept where emp.e_id = dept.e_id and emp.e_city = dept.location ;",dataBase)

   e_id e_name e_city dept_no dept_name Location  e_id
0     1    Ram  Delhi      D1        HR    Delhi     1

###### THETA JOIN

In [27]:
pd.read_sql("select * from emp join dept on emp.e_city>dept.location ;",dataBase)

   e_id e_name  e_city dept_no dept_name   Location  e_id
0     2  Varun  Mumbai      D1        HR      Delhi     1
1     2  Varun  Mumbai      D2        IT  Hyderabad     2
2     3   Ravi  Mumbai      D1        HR      Delhi     1
3     3   Ravi  Mumbai      D2        IT  Hyderabad     2

###### INNER JOIN

In [50]:
pd.read_sql("select * from emp inner join dept on emp.e_id=dept.e_id ;",dataBase)

   e_id e_name  e_city dept_no  dept_name   Location  e_id
0     1    Ram   Delhi      D1         HR      Delhi     1
1     2  Varun  Mumbai      D2         IT  Hyderabad     2
2     4  Amrit   Delhi      D3  Marketing     Mumbai     4

###### LEFT OUTER JOIN

In [35]:
pd.read_sql("select emp.e_id,e_name,dept_name,location from emp left outer join dept on emp.e_id=dept.e_id ;",dataBase)

   e_id e_name  dept_name   location
0     1    Ram         HR      Delhi
1     2  Varun         IT  Hyderabad
2     4  Amrit  Marketing     Mumbai
3     3   Ravi       None       None

###### RIGHT OUTER JOIN

In [47]:
pd.read_sql("select emp.e_id,e_name,dept_name,location from emp right outer join dept on emp.e_id=dept.e_id ;",dataBase)

   e_id e_name  dept_name   location
0     1    Ram         HR      Delhi
1     2  Varun         IT  Hyderabad
2     4  Amrit  Marketing     Mumbai

###### FULL OUTER JOIN

In [48]:
pd.read_sql("select emp.e_id,e_name,dept_name,location from emp left outer join dept on emp.e_id=dept.e_id\
            UNION\
            select emp.e_id,e_name,dept_name,location from emp right outer join dept on emp.e_id=dept.e_id;",dataBase)

   e_id e_name  dept_name   location
0     1    Ram         HR      Delhi
1     2  Varun         IT  Hyderabad
2     4  Amrit  Marketing     Mumbai
3     3   Ravi       None       None